Repository: brokensmile2103/init-view-count
Catalog: languages/init-view-count-*.po
Languages: vi

source: Init View Count – Minimal, Accurate, Extensible
vi: Init View Count – Tối giản, Chính xác, Mở rộng dễ dàng

source: Lightweight plugin to track real post views with scroll & delay detection, smart ranking, and flexible shortcodes.
vi: Plugin nhẹ để theo dõi lượt xem bài viết thực bằng cách phát hiện cuộn trang & thời gian, xếp hạng thông minh và hỗ trợ shortcode linh hoạt.

source: Init View Count Settings
vi: Cài đặt Init View Count

source: Settings
vi: Cài đặt

source: Settings saved.
vi: Đã lưu cài đặt.

source: Post types to track views
vi: Các loại bài viết cần theo dõi lượt xem

source: Enable daily views?
vi: Bật theo dõi lượt xem theo ngày?

source: Enable weekly views?
vi: Bật theo dõi lượt xem theo tuần?

source: Enable monthly views?
vi: Bật theo dõi lượt xem theo tháng?

source: Delay before counting (ms)
vi: Thời gian trễ trước khi tính lượt xem (ms)

source: Scroll percent required
vi: Phần trăm cuộn trang yêu cầu

source: Enable scroll check?
vi: Bật kiểm tra cuộn trang?

source: Storage method
vi: Phương thức lưu trữ

source: Session Storage
vi: Bộ nhớ phiên (Session)

source: Local Storage
vi: Bộ nhớ cục bộ (Local)

source: Disable plugin CSS?
vi: Tắt CSS của plugin?

source: Save Settings
vi: Lưu cài đặt

source: All Time
vi: Tất cả

source: Today
vi: Hôm nay

source: This Week
vi: Tuần này

source: This Month
vi: Tháng này

source: Yesterday
vi: Hôm qua

source: Last Week
vi: Tuần trước

source: Last Month
vi: Tháng trước

source: No data found.
vi: Không có dữ liệu.

source: Failed to load data.
vi: Lỗi khi tải dữ liệu.

source: Disable built-in CSS output.
vi: Tắt CSS mặc định của plugin.

source: Check this if you want to fully control the styling yourself. The plugin will not enqueue any CSS.
vi: Chọn nếu bạn muốn tự kiểm soát hoàn toàn phần giao diện. Plugin sẽ không tự thêm bất kỳ CSS nào.

source: Popular Posts
vi: Bài viết nổi bật

source: views
vi: lượt xem

source: Copy
vi: Sao chép

source: Copied!
vi: Đã sao chép!

source: Close
vi: Đóng

source: Shortcode Preview
vi: Xem trước Shortcode

source: Shortcode Builder
vi: Trình tạo Shortcode

source: Type
vi: Loại

source: Title
vi: Tiêu đề

source: Number of Posts
vi: Số lượng bài viết

source: Template
vi: Giao diện

source: View Range
vi: Khoảng thời gian

source: Post Type
vi: Loại bài viết

source: Category
vi: Chuyên mục

source: Tag
vi: Thẻ

source: Order By
vi: Sắp xếp theo

source: Order Direction
vi: Thứ tự sắp xếp

source: Custom CSS class
vi: Class CSS tùy chỉnh

source: Field
vi: Trường dữ liệu

source: Format
vi: Định dạng

source: Show Time Diff
vi: Hiển thị thời gian đăng

source: Tabs
vi: Các tab

source: Posted %s ago
vi: Đăng %s trước

source: Batch view tracking
vi: Gộp lượt xem

source: Number of views to collect before sending to server. Set to 1 for real-time tracking. Higher values reduce server requests but may miss some views if user leaves early.
vi: Số lượt xem cần gom lại trước khi gửi lên server. Đặt là 1 để theo dõi theo thời gian thực. Giá trị cao hơn sẽ giảm số lượng request, nhưng có thể mất lượt xem nếu người dùng rời khỏi trang trước khi gửi.

source: Enable strict IP check?
vi: Bật kiểm tra IP nghiêm ngặt?

source: Adds extra protection against bots or fake requests directly posting to the tracking endpoint. Useful if you see unusual traffic not blocked by countdown or scroll check.
vi: Thêm lớp bảo vệ chống bot hoặc yêu cầu giả mạo gửi thẳng đến endpoint đếm view. Hữu ích nếu bạn phát hiện lưu lượng bất thường không bị chặn bởi countdown hoặc kiểm tra cuộn trang.

source: Stores a hashed list of recent IPs per post in a transient to prevent repeated views from the same IP within a short time window.
vi: Lưu danh sách IP đã mã hóa gần đây theo từng bài viết bằng transient để ngăn lượt xem lặp lại từ cùng một IP trong khoảng thời gian ngắn.

source: Enable dashboard widget?
vi: Bật widget bảng xếp hạng?

source: Display top view ranking inside WordPress Dashboard.
vi: Hiển thị bảng xếp hạng lượt xem trong Bảng tin WordPress.

source: Uncheck to hide the widget for all users.
vi: Bỏ chọn để ẩn widget với tất cả người dùng.

source: Count and store views per day
vi: Đếm và lưu lượt xem theo ngày

source: Track total views by week
vi: Theo dõi tổng lượt xem theo tuần

source: Track total views by month
vi: Theo dõi tổng lượt xem theo tháng

source: Only count views after user scrolls past required percent
vi: Chỉ đếm khi người dùng cuộn vượt qua phần trăm yêu cầu

source: Auto-insert shortcode into post content?
vi: Tự động chèn shortcode vào nội dung bài viết?

source: Do not auto-insert (manual shortcode only)
vi: Không tự chèn (chỉ dùng shortcode thủ công)

source: Insert before content
vi: Chèn trước nội dung

source: Insert after content
vi: Chèn sau nội dung

source: Only applies to post types where view count is enabled. Developers can always insert shortcode manually.
vi: Chỉ áp dụng cho các post type đã bật đếm view. Lập trình viên luôn có thể chèn thủ công bằng shortcode.

source: Show Icon
vi: Hiện biểu tượng

source: Enable Schema.org
vi: Bật hỗ trợ Schema.org

source: Custom Class
vi: Lớp CSS tùy chỉnh

source: Disable Trending?
vi: Tắt tính năng Trending?

source: Completely turn off trending calculations and outputs.
vi: Tắt hoàn toàn việc tính toán và hiển thị Trending.

source: Check this to hard-disable trending.
vi: Đánh dấu để vô hiệu hóa Trending.
